package utils

import (
	"math/rand"
)

var seg1 = []string{
	"暖洋洋", "醉醺醺", "香喷喷", "干巴巴", "沉甸甸", "羞答答", "亮晶晶",
	"沉甸甸", "白花花", "绿油油", "黑黝黝", "慢腾腾", "阴森森", "皱巴巴",
	"亮铮铮", "笑嘻嘻", "香喷喷", "乱哄哄", "黑漆漆", "轻飘飘", "湿漉漉",
	"红彤彤", "骨碌碌", "雾朦朦", "喜盈盈", "亮晶晶", "黄灿灿", "孤零零",
	"毛绒绒", "胖乎乎", "一颗颗", "一簇簇", "绿油油", "黄澄澄", "红彤彤",
}
var seg2 = []string{
	"禾花雀", "鳜鱼", "羚牛", "黑犀牛", "椋鸟", "白颏海燕", "扁头摄魂蜂",
	"中华花龟", "旅鼠", "桶水母", "贻贝", "红嘴相思鸟", "吸血蝙蝠", "巨型蜘蛛蟹",
	"跳蛛", "齿猛蚁", "蜜獾", "毛丝鼠", "陷阱颚蚁", "颚口线虫", "红树林树雀",
	"高智商动物", "大鼠", "布偶猫", "黄鹂", "羞死鸟", "甲鱼", "多鳍鱼", "赛马",
}
var seg3 = []string{
	"欣赏", "检查", "遇见", "接触", "追赶", "梦见", "倾听",
	"看见", "听见", "迷惑", "质疑", "审查", "检查", "欺骗",
	"释放", "封禁", "教育", "观赏", "评价", "拉扯", "敷衍",
}
var seg4 = []string{
	"光闪闪", "油乎乎", "光溜溜", "黑油油", "粘糊糊", "亮晶晶", "脏兮兮",
	"皱巴巴", "干巴巴", "松塌塌", "胖墩墩", "肉墩墩", "瘦巴巴", "瘦嶙嶙",
	"喜洋洋", "喜滋滋", "喜冲冲", "兴冲冲", "乐悠悠", "乐陶陶", "乐滋滋",
	"白花花", "绿莹莹", "黄澄澄", "绿油油", "明晃晃", "慢腾腾", "沉甸甸",
}
var seg5 = []string{
	"弓形虫", "复变甲", "螳水蝇", "钩翅石蛾", "旌蛉", "蚊蝎蛉", "鸭嘴兽", "普尔加托里猴",
	"貘", "蜱虫", "变形蛙", "褐飞虱", "果壳綦江龙", "猎鹰", "隐尾蠊", "吸血鬼蟹",
	"猿猴", "腔棘鱼", "孔雀跳蛛", "红色动物", "盔犀鸟", "透明鱼", "沟齿鼩", "安第斯眼镜熊",
	"线虫", "缅因猫", "火体虫",
}

func GenerateCode() string {
	return string(seg1[rand.Intn(35)] + "的" + seg2[rand.Intn(29)] + seg3[rand.Intn(21)] + seg4[rand.Intn(28)] + "的" + seg5[rand.Intn(26)])
}
